Revit 2027 API
ViewSchedule.IsTitleblockRevisionSchedule Property
 Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTitleblockRevisionSchedule { get; }
Public ReadOnly Property IsTitleblockRevisionSchedule As Boolean
	Get
public:
property bool IsTitleblockRevisionSchedule {
	bool get ();
}
member IsTitleblockRevisionSchedule : bool with get
Property Value
Boolean
Remarks
 These schedules cannot be modified by the user or placed on sheets.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace